code-review/NRB_3471_3546/База_Было/Documents/ГлобальнаяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ГлобальнаяОперация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЦБДепозитарийМХ</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБМестоРасчетов</xr:Item>
				<xr:Item>AccumulationRegister.ДивидендыИКупоны</xr:Item>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБ</xr:Item>
				<xr:Item>AccumulationRegister.ЦБВПути</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГлобальнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплатаНа1ЦБ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РазмерВыплатыНа1ЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВнесенияЗаписиВЕГРЮЛ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияВДепозитарииМХ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияВМестеРасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий350</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежныйАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонвертации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонвертаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумагаБазовая</Name>
					<Comment>Базовая ценная бумага для начисления дохода ценными бумагами</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЦБ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНалога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБазовойЦБ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Списание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЦБ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЦБ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/AccumulationRegisters/ОстаткиЦБМестоРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦБМестоРасчетов</Name>
			<Comment>Остатки ЦБ по дате исполнения в месте расчетов</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/УслугиТарифногоПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УслугиТарифногоПлана</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКомиссии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКомиссий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачисленияКомиссий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеСуммыНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДСКомиссии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьПриОтбореПеречисленныеВидыЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтборПоМХ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборПоВидуЦБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦББанкаРоссии</Name>
							<Comment>Вид ценной бумаги банка РФ</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦББанкаРоссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ГлобальнаяОперация/Ext/ObjectModule.bsl
Перем УслугаОперации, Тариф;	// Для операции "Погашение"

////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ВСЕХ ГЛОБАЛЬНЫХ ОПЕРАЦИЙ //
////////////////////////////////////////////////////////////

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если Проверка Тогда
		Возврат;
	КонецЕсли;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс,ПометкаУдаления);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Если это документ, загруженный через обмен, то не выполняем проверки
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	// Проверки реквизитов
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ТипЗнч(ВидГлобальнойОперации) = Тип("СправочникСсылка.ВидыОпераций") Тогда
		// Проверка заполнения табличной части "Ценные бумаги"
		Если ЦенныеБумаги.Количество() = 0 И НЕ ВидГлобальнойОперации = Справочники.ВидыОпераций.Конвертация Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не выбрано ни одного депонента!", Отказ); 
			Возврат;
		КонецЕсли;	
		// Проверка заполнения поля "Инициатор" для операций "Погашение ЦБ"
		Если (ВидГлобальнойОперации = Справочники.ВидыОпераций.Погашение
			ИЛИ ВидГлобальнойОперации = Справочники.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента
			ИЛИ ВидГлобальнойОперации = Справочники.ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг
			ИЛИ ВидГлобальнойОперации = Справочники.ВидыОпераций.Конвертация
			ИЛИ ВидГлобальнойОперации = Справочники.ВидыОпераций.ВыкупСписаниеЦБ)
			И ОбщегоНазначения.ЗначениеНеЗаполнено(Инициатор) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не указан 'Инициатор'", Отказ);  
			Возврат;
		КонецЕсли;	
		// Проверка заполнения поля "Ценная бумага"
		Если НЕ ЗначениеЗаполнено(ЦеннаяБумага)	И НЕ ВидГлобальнойОперации = Справочники.ВидыОпераций.Конвертация Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не выбрана 'Ценная бумага'", Отказ);
			Возврат;
		КонецЕсли;
		// Если нет строк "Списания" или "Зачисления" по операции "Конвертация", то ругаемся и не проводим
		Если ВидГлобальнойОперации = Справочники.ВидыОпераций.Конвертация
			И Списание.Количество() = 0 И Зачисление.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнены данные таблиц 'Конвертации' для обработки", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(ВидГлобальнойОперации) = Тип("СправочникСсылка.ВидыОпераций") И ВидГлобальнойОперации.ДвижениеПоЦБ Тогда
		Если НЕ ЗначениеЗаполнено(ДатаИсполненияВДепозитарииМХ) Или Не ЗначениеЗаполнено(ДатаИсполненияВМестеРасчетов) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Необходимо указывать даты исполнения в депозитарии МХ и в месте расчетов!", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// Установим новый номер перед записью
	УстановитьНовыйНомер();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Если "Банковский счет" не заполнен, то не проводим "Погашение НКД", "Погашение ЦБ Полное" И "Погашение ЦБ частичное"
	Если (ВидГлобальнойОперации = Справочники.ВидыОпераций.ПогашениеНКД
		ИЛИ ВидГлобальнойОперации = Справочники.ВидыОпераций.Выкуп
		ИЛИ ВидГлобальнойОперации = Справочники.ВидыОпераций.ПогашениеЦБПолное 
		ИЛИ ВидГлобальнойОперации = Справочники.ВидыОпераций.ПогашениеЦБЧастичное) 
		И Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("В документе поручение не заполнен Банковский счет!", Отказ);
		Возврат;
	КонецЕсли;
	
	Движения.ОстаткиЦБ.Очистить();
	Движения.ОстаткиЦБДепозитарийМХ.Очистить();
	Движения.ОстаткиЦБМестоРасчетов.Очистить();
	
	Если ВидГлобальнойОперации.ВыплатаДоходаВДенежнойФорме Тогда
		
		Если ВидГлобальнойОперации = Справочники.ВидыОпераций.НачислениеДивидендов
			Или ВидГлобальнойОперации = Справочники.ВидыОпераций.НачислениеДоходаПрочие Тогда			
			
			РезультатЗапроса= ПолучитьРезультатЗапросаПоДивидендам(Ссылка, ВидДвиженияНакопления.Расход);
			Записи			= РезультатЗапроса.Выгрузить();
			Движения.ДивидендыИКупоны.Загрузить(Записи);
			
		КонецЕсли;
		
	ИначеЕсли (ВидГлобальнойОперации = Справочники.ВидыОпераций.Погашение
		ИЛИ ВидГлобальнойОперации = Справочники.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента
		ИЛИ ВидГлобальнойОперации = Справочники.ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг
		ИЛИ ВидГлобальнойОперации = Справочники.ВидыОпераций.ВыкупСписаниеЦБ) Тогда
		
		// Получим таблицу с остатками ЦБ по регистру накопления ОстаткиЦБ
		ТаблицаОстатковЦБ = ТаблицаОстаткиЦБДляСписания(Дата, "ОстаткиЦБ");
		
		// Проверим достаточность остатков по регистру ОстаткиЦБ и, если нужно, по ОстаткиЦБДепозитарийМХ и ОстаткиЦБМестоРасчетов
		Отказ = НЕ ДостаточноОстатковЦБДляСписания(ТаблицаОстатковЦБ);
		
		// Изменим флаг услуг
		флУслуги = Ложь;
		
		// Добавим движения
		Если НЕ Отказ Тогда
			ЗагрузитьДвиженияРегистровГруппыОстаткиЦБИзТаблицы(ТаблицаОстатковЦБ, флУслуги, ВидДвиженияНакопления.Расход);
		КонецЕсли;
		
	ИначеЕсли ВидГлобальнойОперации = Справочники.ВидыОпераций.НачислениеДоходовЦБ Тогда
		
		// Получим таблицу с ЦБ из документа
		ТаблицаЦБ = ТаблицаЦБДляНачисления();
		
		// Изменим флаг услуг
		флУслуги = Ложь;
		
		// Добавим движения
		Если НЕ Отказ Тогда
			ЗагрузитьДвиженияРегистровГруппыОстаткиЦБИзТаблицы(ТаблицаЦБ, флУслуги, ВидДвиженияНакопления.Приход);
		КонецЕсли;
		
	ИначеЕсли (ВидГлобальнойОперации = Справочники.ВидыОпераций.Конвертация) Тогда
		//Определяем делать ли движения по регистру УслугиДепозитария
		Если ЗначениеЗаполнено(ТарифныйПлан) Тогда
			УслугаОперации = Справочники.УслугиТарифногоПлана.УслугаТарифногоПланаПоРеквизиту("Операция",
				Справочники.ВидыОпераций.Конвертация, ,Неопределено);
			//Проверка существования услуги.
			Если НЕ УслугаОперации.Пустая() Тогда
				Тариф		= 	РегистрыСведений.Тарифы.ПолучитьПоследнее(Дата, Новый Структура("Услуга",УслугаОперации));
				Если Тариф = Неопределено Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Не определен тариф услуги депозитария - " + УслугаОперации, Отказ);
					Возврат;
				Иначе
					Услуги	= Истина;
				КонецЕсли; 		
			Иначе
				ОбщегоНазначения.СообщитьОбОшибке("Данная услуга - не определена в справочнике /Услуги тарифного плана/.", Отказ);
				Возврат;
			КонецЕсли; 	
			Услуги	= Ложь;
		Иначе
			Услуги	= Ложь;
		КонецЕсли;
		
		ВыполнитьДвиженияКонвертации(Тариф, Услуги, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ НАЧИСЛЕНИЯ ДИВИДЕНДОВ    //
////////////////////////////////////////////////////////////

Функция ПолучитьРезультатЗапросаПоДивидендам(Ссылка, ВидДвижения)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка										КАК Ссылка,
	|	Ссылка.Дата									КАК Период,
	|	Ссылка.ЦеннаяБумага 						КАК ЦеннаяБумага,
	|	Ссылка.СчетДепо.Владелец					КАК Депонент,
	|	Количество									КАК Количество,
	|	Сумма										КАК Сумма,
	|	Ссылка.ЦеннаяБумага.ВалютаНоминала			КАК ВалютаНоминала,
	|	Ссылка.БанковскийСчет						КАК БанковскийСчет,
	|	&ВидДвижения								КАК ВидДвижения,
	|	Ссылка.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта
	|ИЗ
	|	Документ.ГлобальнаяОперация.ЦенныеБумаги
	|ГДЕ
	|	Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка"		, Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения"	, ВидДвижения);
	
	Возврат Запрос.Выполнить();
КонецФункции

////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ПОГАШЕНИЯ ЦБ		  	  //
////////////////////////////////////////////////////////////

Функция ТаблицаОстаткиЦБДляСписания(Дата, ИмяРегистраНакопления)
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиЦБ.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБ.ЦБ КАК ЦБ,
	|	ОстаткиЦБ.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБ.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ОстаткиЦБ.СтатусЦБ КАК СтатусЦБ,
	|	ОстаткиЦБ.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ВТ_ОстаткиЦБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&выбДата,
	|		ЦБ = &выбЦБ
	|		И (&выбСчетДепо = ЗНАЧЕНИЕ(Справочник.СчетаДепо.ПустаяСсылка) ИЛИ СчетДепо = &выбСчетДепо)) КАК ОстаткиЦБ
	|;
	|
	|////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка.СчетДепо КАК СчетДепо,
	|	ЦенныеБумаги.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ЦенныеБумаги.ЦеннаяБумага КАК ЦБ,
	|	ЦенныеБумаги.СчетДепоМХ КАК СчетДепоМХ,
	|	ЦенныеБумаги.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ЕСТЬNULL(ВТ_ОстаткиЦБ.СтатусЦБ, &СтатусЦБПоУмолчанию) КАК СтатусЦБ,
	|	СУММА(ЦенныеБумаги.Количество) КАК КоличествоОстаток,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиЦБ.Количество, 0)) КАК КоличествоНаОстаткахЦБ
	|
	|ИЗ
	|	Документ.ГлобальнаяОперация.ЦенныеБумаги КАК ЦенныеБумаги
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВТ_ОстаткиЦБ КАК ВТ_ОстаткиЦБ
	|	ПО
	|		ЦенныеБумаги.Ссылка.СчетДепо = ВТ_ОстаткиЦБ.СчетДепо 
	|		И ЦенныеБумаги.РазделСчетаДепо = ВТ_ОстаткиЦБ.РазделСчетаДепо 
	|		И ЦенныеБумаги.ЦеннаяБумага = ВТ_ОстаткиЦБ.ЦБ 
	|		И ЦенныеБумаги.СчетДепоМХ = ВТ_ОстаткиЦБ.СчетДепоМХ 
	|		И ЦенныеБумаги.РазделСчетаДепоМХ = ВТ_ОстаткиЦБ.РазделСчетаДепоМХ 
	|ГДЕ
	|	ЦенныеБумаги.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумаги.Ссылка.СчетДепо,
	|	ЦенныеБумаги.РазделСчетаДепо,
	|	ЦенныеБумаги.ЦеннаяБумага,
	|	ЦенныеБумаги.СчетДепоМХ,
	|	ЦенныеБумаги.РазделСчетаДепоМХ,
	|	ЕСТЬNULL(ВТ_ОстаткиЦБ.СтатусЦБ, &СтатусЦБПоУмолчанию)
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрНакопления.ОстаткиЦБ", "РегистрНакопления."+ИмяРегистраНакопления);
	
	Запрос.УстановитьПараметр("выбДата", Дата);
	Запрос.УстановитьПараметр("выбЦБ", ЦеннаяБумага);
	Запрос.УстановитьПараметр("выбСчетДепо", СчетДепо);
	Запрос.УстановитьПараметр("СтатусЦБПоУмолчанию", Перечисления.СтатусыЦБ.Свободна);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ТаблицаЦБДляНачисления()
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка.СчетДепо КАК СчетДепо,
	|	ЦенныеБумаги.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ЦенныеБумаги.ЦеннаяБумага КАК ЦБ,
	|	ЦенныеБумаги.СчетДепоМХ КАК СчетДепоМХ,
	|	ЦенныеБумаги.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	&СтатусЦБПоУмолчанию КАК СтатусЦБ,
	|	СУММА(ЦенныеБумаги.Количество) КАК КоличествоОстаток
	|ИЗ
	|	Документ.ГлобальнаяОперация.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумаги.Ссылка.СчетДепо,
	|	ЦенныеБумаги.РазделСчетаДепо,
	|	ЦенныеБумаги.ЦеннаяБумага,
	|	ЦенныеБумаги.СчетДепоМХ,
	|	ЦенныеБумаги.РазделСчетаДепоМХ,
	|	&СтатусЦБПоУмолчанию
	|";
	
	Запрос.УстановитьПараметр("СтатусЦБПоУмолчанию", Перечисления.СтатусыЦБ.Свободна);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Возвращает Истина, если остаток в ТаблицаОстатковЦБ достаточен для списания.
// Начиная с даты доп. движений также проверяются остатки по регистрам ОстаткиЦБДепозитарийМХ
// и ОстаткиЦБМестоРасчетов на соответствующие даты.
// Если хотя бы по одному регистру остатка не достаточно, возвращает Ложь и выводит сообщение об ошибке.
Функция ДостаточноОстатковЦБДляСписания(ТаблицаОстатковЦБ)
	ШаблонОшибки = "Количество списания ценных бумаг {Кол} превышает остаток {Ост} на счете клиента {Комментарий}
		|(регистр ""{ИмяРег}"" на {Дата})
		|ЦБ: {ЦБ}  ISIN: {ISIN}  Статус ЦБ: {СтатусЦБ}
		|Счет ДЕПО: {СчетДепо}
		|Раздел счета ДЕПО: {РазделСчетаДепо}
		|Счет ДЕПО места хранения: {СчетДепоМХ}
		|Раздел счета ДЕПО места хранения: {РазделСчетаДепоМХ}";
	
	// Проверим остатки 
	ОстатковДостаточно = ДостаточноОстатковПоТаблице(ТаблицаОстатковЦБ, ШаблонОшибки, "на дату глобальной операции",
		Метаданные.РегистрыНакопления.ОстаткиЦБ.Синоним, Дата);
	
	// Если нужно, проверим остатки по другим регистрам: ОстаткиЦБДепозитарийМХ и ОстаткиЦБМестоРасчетов 
	Если ОстатковДостаточно
		И ТипЗнч(ВидГлобальнойОперации) = Тип("СправочникСсылка.ВидыОпераций") И ВидГлобальнойОперации.ДвижениеПоЦБ Тогда
		// Проверим остатки по регистру накопления ОстаткиЦБДепозитарийМХ
		ДатаВремяМХ = ОбъединениеДатыВремени(ДатаИсполненияВДепозитарииМХ, Дата);
		ТаблицаОстатковМХ = ТаблицаОстаткиЦБДляСписания(ДатаВремяМХ, "ОстаткиЦБДепозитарийМХ");
		ОстатковДостаточно = ДостаточноОстатковПоТаблице(ТаблицаОстатковМХ, ШаблонОшибки, "на дату исполнения в депозитарии МХ",
			Метаданные.РегистрыНакопления.ОстаткиЦБДепозитарийМХ.Синоним, ДатаВремяМХ);
		
		Если ОстатковДостаточно Тогда
			// Проверим остатки по регистру накопления ОстаткиЦБМестоРасчетов
			ДатаВремяМР = ОбъединениеДатыВремени(ДатаИсполненияВМестеРасчетов, Дата);
			ТаблицаОстатковМР = ТаблицаОстаткиЦБДляСписания(ДатаВремяМР, "ОстаткиЦБМестоРасчетов");
			ОстатковДостаточно = ДостаточноОстатковПоТаблице(ТаблицаОстатковМР, ШаблонОшибки, "на дату исполнения в месте расчетов",
				Метаданные.РегистрыНакопления.ОстаткиЦБМестоРасчетов.Синоним, ДатаВремяМР);
		КонецЕсли;
	КонецЕсли;
	
	Если ОстатковДостаточно Тогда
		Возврат Истина;
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке(ШаблонОшибки);
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Возвращает Истина, если остаток в ТаблицаОстатков достаточен для списания.
// Иначе - Ложь и заполняется шаблон ошибки
Функция ДостаточноОстатковПоТаблице(ТаблицаОстатков, ШаблонОшибки, Комментарий, ИмяРег, Дата)
	Для каждого Строка из ТаблицаОстатков Цикл
		Если Строка.КоличествоОстаток > Строка.КоличествоНаОстаткахЦБ Тогда
			ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{Кол}",				Строка.КоличествоОстаток);
			ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{Ост}",				Строка.КоличествоНаОстаткахЦБ);
			ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{Комментарий}",		Комментарий);
			ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{ИмяРег}",			ИмяРег);
			ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{Дата}",				Дата);
			ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{ЦБ}",				Строка.ЦБ);
			ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{ISIN}",				Строка.ЦБ.ISIN);
			ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{СтатусЦБ}",			Строка.СтатусЦБ);
			ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{СчетДепо}",			Строка.СчетДепо);
			ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{РазделСчетаДепо}",	Строка.РазделСчетаДепо);
			ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{СчетДепоМХ}",		Строка.СчетДепоМХ);
			ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{РазделСчетаДепоМХ}",	Строка.РазделСчетаДепоМХ);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

Процедура ЗагрузитьДвиженияРегистровГруппыОстаткиЦБИзТаблицы(ТабДвижений, флДелатьДвиженияПоРегиструУслуг, ВидДвижения)
	Для Каждого СтрокаЦБ Из ТабДвижений Цикл
		ДобавитьДвиженияВОстаткиЦБ(ВидДвижения,
			СтрокаЦБ.СчетДепо, СтрокаЦБ.РазделСчетаДепо, СтрокаЦБ.ЦБ,
			СтрокаЦБ.СчетДепоМХ, СтрокаЦБ.РазделСчетаДепоМХ, СтрокаЦБ.СтатусЦБ, СтрокаЦБ.КоличествоОстаток);
		
		Если флДелатьДвиженияПоРегиструУслуг Тогда
			ДепозитарийКлиент.СоздатьДвиженияДокумента(Дата, Движения, СтрокаЦБ.СчетДепо.Владелец ,УслугаОперации, Тариф);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Добавляет движения в регистр накопления ОстаткиЦБ, а для видов операции с установленным флажком ДвижениеПоЦБ
// начиная с даты доп. движений также и в регистры накопления ОстаткиЦБДепозитарийМХ и ОстаткиЦБМестоРасчетов.
// При этом в движениях по этим регистрам в качестве периода используются ДатаИсполненияВДепозитарииМХ
// и ДатаИсполненияВМестеРасчетов соответственно (из этих реквизитов берется дата, из "Дата" берется время).
Процедура ДобавитьДвиженияВОстаткиЦБ(ВидДвижения, СчетДепо, РазделСчетаДепо, ЦБ, СчетДепоМХ, РазделСчетаДепоМХ,
	СтатусЦБ, Количество)
	
	Движение = Движения.ОстаткиЦБ.Добавить(); 
	Движение.ВидДвижения		= ВидДвижения;
	Движение.Период				= Дата;		// По основному регистру движение делается на дату документа
	Движение.СчетДепо			= СчетДепо;
	Движение.РазделСчетаДепо	= РазделСчетаДепо;
	Движение.ЦБ					= ЦБ;
	Движение.СчетДепоМХ			= СчетДепоМХ;
	Движение.РазделСчетаДепоМХ	= РазделСчетаДепоМХ;
	Движение.СтатусЦБ			= СтатусЦБ;
	Движение.Количество			= Количество;
	
	Если ТипЗнч(ВидГлобальнойОперации) = Тип("СправочникСсылка.ВидыОпераций") И ВидГлобальнойОперации.ДвижениеПоЦБ Тогда
		Движение = Движения.ОстаткиЦБДепозитарийМХ.Добавить(); 
		Движение.ВидДвижения		= ВидДвижения;
		Движение.Период				= ОбъединениеДатыВремени(ДатаИсполненияВДепозитарииМХ, Дата);	// Дата - специальная дата, время - из стандартной даты
		Движение.СчетДепо			= СчетДепо;
		Движение.РазделСчетаДепо	= РазделСчетаДепо;
		Движение.ЦБ					= ЦБ;
		Движение.СчетДепоМХ			= СчетДепоМХ;
		Движение.РазделСчетаДепоМХ	= РазделСчетаДепоМХ;
		Движение.СтатусЦБ			= СтатусЦБ;
		Движение.Количество			= Количество;
		
		Движение = Движения.ОстаткиЦБМестоРасчетов.Добавить(); 
		Движение.ВидДвижения		= ВидДвижения;
		Движение.Период				= ОбъединениеДатыВремени(ДатаИсполненияВМестеРасчетов, Дата);	// Дата - специальная дата, время - из стандартной даты
		Движение.СчетДепо			= СчетДепо;
		Движение.РазделСчетаДепо	= РазделСчетаДепо;
		Движение.ЦБ					= ЦБ;
		Движение.СчетДепоМХ			= СчетДепоМХ;
		Движение.РазделСчетаДепоМХ	= РазделСчетаДепоМХ;
		Движение.СтатусЦБ			= СтатусЦБ;
		Движение.Количество			= Количество;
	КонецЕсли;
КонецПроцедуры

//////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ КОНВЕРТАЦИИ						//
//////////////////////////////////////////////////////////////////////

Процедура ВыполнитьДвиженияКонвертации(Тариф, Услуги, Отказ)
	// Списание ЦБ
	Для Каждого СтрокаСписания Из Списание Цикл
		ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Расход,
			СчетДепо, СтрокаСписания.РазделСчетаДепо, СтрокаСписания.ЦеннаяБумага,
			СтрокаСписания.СчетДепоМХ, СтрокаСписания.РазделСчетаДепоМХ, СтрокаСписания.СтатусЦБ,
			СтрокаСписания.Количество);
	КонецЦикла;
	
	// Зачисление ЦБ
	Для Каждого СтрокаЗачисления Из Зачисление Цикл

		ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Приход,
			СчетДепо, СтрокаЗачисления.РазделСчетаДепо, СтрокаЗачисления.ЦеннаяБумага,
			СтрокаЗачисления.СчетДепоМХ, СтрокаЗачисления.РазделСчетаДепоМХ, СтрокаЗачисления.СтатусЦБ,
			СтрокаЗачисления.Количество);

	КонецЦикла;
КонецПроцедуры

// Возвращает значение, содержащее дату и время из соответствующих источников
Функция ОбъединениеДатыВремени(ИсточникДаты, ИсточникВремени)
	Возврат Дата(Год(ИсточникДаты), Месяц(ИсточникДаты), День(ИсточникДаты),
		Час(ИсточникВремени), Минута(ИсточникВремени), Секунда(ИсточникВремени));
КонецФункции
